Revit 2027 API
PointIterator.Current Property
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CloudPoint Current { get; }
Public Overridable ReadOnly Property Current As CloudPoint
	Get
public:
virtual property CloudPoint Current {
	CloudPoint get ();
}
abstract Current : CloudPoint with get
override Current : CloudPoint with get
Property Value
CloudPoint
Implements
IEnumerator<T>.Current
See Also
Reference
PointIterator Class
Autodesk.Revit.DB.PointClouds Namespace